In [2]:
import numpy as np 
import pandas as pd

2번

In [9]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

A

In [11]:
titanic["category1"] = titanic.apply(lambda r: r.sex if r.age >= 20 else "child", axis=1)
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,child
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True,male
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,child
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,female
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False,child

B

In [12]:
# 나이 평균
titanic["age"].mean()

29.69911764705882

In [54]:
titanic["age"] = titanic["age"].fillna(titanic["age"].mean()).round(2)
titanic.tail(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category3,ageGroup
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,male,중년,A3
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True,female,청년,A2
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True,male,청년,A2
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True,male,청년,A1
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False,female,중년,A3
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male,청년,A1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,미성년자,A1
888,0,3,female,29.7,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,청년,A2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,청년,A2
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male,중년,A3

C

In [14]:
survived_count = titanic["survived"].count()
survived_count

891

In [56]:
a= (titanic["survived"] == 1)
survived_count1 =  titanic[a]
survived_count1

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category3,ageGroup
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,중년,A3
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,청년,A2
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,중년,A3
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,female,청년,A2
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False,child,미성년자,A1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True,child,미성년자,A1
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False,female,장년,A3
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False,female,청년,A2
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,미성년자,A1
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,청년,A2

In [73]:
b = (titanic["sex"] == "female")
con1 = titanic.loc[a & b]
con1

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category3,ageGroup
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,중년,A3
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,청년,A2
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,중년,A3
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,female,청년,A2
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False,child,미성년자,A1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
874,1,2,female,28.0,1,0,24.0000,C,Second,woman,False,NaN,Cherbourg,yes,False,female,청년,A2
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True,child,미성년자,A1
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False,female,장년,A3
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False,female,청년,A2
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,미성년자,A1

In [79]:
titanic[b]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category3,ageGroup
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,중년,A3
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,청년,A2
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,중년,A3
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,female,청년,A2
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False,child,미성년자,A1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False,female,청년,A2
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True,female,청년,A2
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False,female,중년,A3
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,미성년자,A1
888,0,3,female,29.7,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,청년,A2

In [57]:
survived_count1.count()

survived       342
pclass         342
sex            342
age            342
sibsp          342
parch          342
fare           342
embarked       340
class          342
who            342
adult_male     342
deck           136
embark_town    340
alive          342
alone          342
category1      342
category3      330
ageGroup       342
dtype: int64

In [21]:
#생존률
#전체  승객수 = 891     
#승객수 성별= 여자314,남자 577

In [36]:
titanic.pivot_table("survived", "sex",  aggfunc="count", margins=True)

        survived
sex
female       314
male         577
All          891

In [74]:
df_sex3= titanic.groupby(["sex","alive"])[["alive"]].count()
df_sex3

              alive
sex    alive
female no        81
       yes      233
male   no       468
       yes      109

In [50]:
#df = titanic.groupby(["sex", "alive",]).count()/alive_count
#df

              survived    pclass       age     sibsp     parch      fare  \
sex    alive
female no     0.236842  0.236842  0.236842  0.236842  0.236842  0.236842
       yes    0.681287  0.681287  0.681287  0.681287  0.681287  0.681287
male   no     1.368421  1.368421  1.368421  1.368421  1.368421  1.368421
       yes    0.318713  0.318713  0.318713  0.318713  0.318713  0.318713

              embarked     class       who  adult_male      deck  embark_town  \
sex    alive
female no     0.236842  0.236842  0.236842    0.236842  0.017544     0.236842
       yes    0.675439  0.681287  0.681287    0.681287  0.266082     0.675439
male   no     1.368421  1.368421  1.368421    1.368421  0.178363     1.368421
       yes    0.318713  0.318713  0.318713    0.318713  0.131579     0.318713

                 alone  category1  total_people   r_alive
sex    alive
female no     0.236842   0.236842      0.236842  0.236842
       yes    0.681287   0.681287      0.681287  0.681287
male   no     1.368421   1.368421      1.368421  1.368421
       yes    0.318713   0.318713      0.318713  0.318713

In [19]:
df_sex = titanic.groupby(["sex", "alive"])[["survived"]].count()/survived_count
df_sex

              survived
sex    alive
female no     0.090909
       yes    0.261504
male   no     0.525253
       yes    0.122334

In [52]:
df_sex = titanic.groupby(["sex", "survived"])[["survived"]].sum()/survived_count
df_sex

                 survived
sex    survived
female 0         0.000000
       1         0.261504
male   0         0.000000
       1         0.122334

In [53]:
df_sex1 = round(titanic.groupby("sex")[["survived"]].sum()/survived_count * 100,2)
df_sex1

        survived
sex
female     26.15
male       12.23

In [20]:
df_class = titanic.groupby(["class", "alive"])[["survived"]].count()/survived_count
df_class

              survived
class  alive
First  no     0.089787
       yes    0.152637
Second no     0.108866
       yes    0.097643
Third  no     0.417508
       yes    0.133558

In [41]:
df_class1 = round(titanic.groupby("class")[["survived"]].count()/survived_count * 100,2)
df_class1

        survived
class
First      24.24
Second     20.65
Third      55.11

In [28]:
df_embark_town = titanic.groupby(["embark_town", "alive"])[["survived"]].count()/survived_count
df_embark_town

                   survived
embark_town alive
Cherbourg   no     0.084175
            yes    0.104377
Queenstown  no     0.052750
            yes    0.033670
Southampton no     0.479237
            yes    0.243547

In [40]:
df_embark_town1 = round(titanic.groupby("embark_town")[["survived"]].count()/survived_count * 100,2)
df_embark_town1

             survived
embark_town
Cherbourg       18.86
Queenstown       8.64
Southampton     72.28

In [18]:
df2 = titanic.groupby(["sex", "class","embark_town"])[["survived"]].count()/survived_count
df2

                           survived
sex    class  embark_town
female First  Cherbourg    0.048260
              Queenstown   0.001122
              Southampton  0.053872
       Second Cherbourg    0.007856
              Queenstown   0.002245
              Southampton  0.075196
       Third  Cherbourg    0.025814
              Queenstown   0.037037
              Southampton  0.098765
male   First  Cherbourg    0.047138
              Queenstown   0.001122
              Southampton  0.088664
       Second Cherbourg    0.011223
              Queenstown   0.001122
              Southampton  0.108866
       Third  Cherbourg    0.048260
              Queenstown   0.043771
              Southampton  0.297419

In [51]:
df4=titanic.pivot_table("embark_town", "sex", "class", aggfunc="count", margins=True)
df4

class   First  Second  Third  All
sex
female     92      76    144  312
male      122     108    347  577
All       214     184    491  889

In [47]:

df4["Third"]["female"]

144

In [48]:
titanic.pivot_table('survived','sex')

        survived
sex
female  0.742038
male    0.188908

In [26]:
titanic.pivot_table('survived',['sex','class','embark_town'])

                           survived
sex    class  embark_town
female First  Cherbourg    0.976744
              Queenstown   1.000000
              Southampton  0.958333
       Second Cherbourg    1.000000
              Queenstown   1.000000
              Southampton  0.910448
       Third  Cherbourg    0.652174
              Queenstown   0.727273
              Southampton  0.375000
male   First  Cherbourg    0.404762
              Queenstown   0.000000
              Southampton  0.354430
       Second Cherbourg    0.200000
              Queenstown   0.000000
              Southampton  0.154639
       Third  Cherbourg    0.232558
              Queenstown   0.076923
              Southampton  0.128302

D

In [24]:
ages = titanic["age"]
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanic["category3"] = pd.cut(ages, bins, labels=labels)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category3
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,청년
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,미성년자
888,0,3,female,29.7,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,청년
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,청년
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,중년

In [25]:
df_category3= titanic.groupby("category3")[["survived"]].count()/survived_count
df_category3

           survived
category3
미성년자       0.185185
청년         0.456790
중년         0.270483
장년         0.066218
노년         0.005612

In [29]:
titanic.pivot_table('survived','category3')

           survived
category3
미성년자       0.424242
청년         0.334152
중년         0.423237
장년         0.355932
노년         0.200000

E

In [31]:
def q3cut(a):
    return pd.qcut(a, 3, labels=["A1", "A2", "A3"]).astype(str)
titanic['ageGroup'] = titanic.groupby(['sex','survived'])[['age']].transform(q3cut)

In [32]:
titanic[['sex','survived','age','ageGroup']]

        sex  survived   age ageGroup
0      male         0  22.0       A1
1    female         1  38.0       A3
2    female         1  26.0       A2
3    female         1  35.0       A3
4      male         0  35.0       A3
..      ...       ...   ...      ...
886    male         0  27.0       A1
887  female         1  19.0       A1
888  female         0  29.7       A2
889    male         1  26.0       A2
890    male         0  32.0       A3

[891 rows x 4 columns]

#참고자료

In [75]:
df_class= titanic.groupby(["class","alive"])[["alive"]].count()
df_class

              alive
class  alive
First  no        80
       yes      136
Second no        97
       yes       87
Third  no       372
       yes      119

In [76]:
df_town= titanic.groupby(["embark_town","alive"])[["alive"]].count()
df_town

                   alive
embark_town alive
Cherbourg   no        75
            yes       93
Queenstown  no        47
            yes       30
Southampton no       427
            yes      217

In [78]:

titanic.pivot_table("sex","class", aggfunc="count", margins=True)

        sex
class
First   216
Second  184
Third   491
All     891

In [ ]:
1